<?php

use App\Enums\ProgressStepEnum;

return [
    ProgressStepEnum::M_FLOW => [
        'บันทึกข้อมูลค้างชำระ',
        'บันทึกข้อมูลแจ้งชำระ',
        'บันทึกข้อมูลการชำระ',  
    ],
    ProgressStepEnum::REGISTER => [
        'เตรียมข้อมูลก่อนจดทะเบียน',
        'บันทึกข้อมูลหลังจดทะเบียน',
    ],

    ProgressStepEnum::OWNERSHIP_TRANSFER => [
        'เตรียมข้อมูลโอนกรรมสิทธิ์',
        'บันทึกวันที่โอนรถ',
        'บันทึกข้อมูลหลังโอนและส่งเล่มคืน',
    ],

    ProgressStepEnum::TAX_RENEWAL => [
        'เตรียมข้อมูลต่ออายุภาษี',
        'กรอกวันที่ส่งต่อภาษี',
        'บันทึกข้อมูลหลังต่อภาษี',
        'ส่งป้ายภาษีและคืนเล่มทะเบียน',
    ],

    ProgressStepEnum::SIGN_YELLOW_TICKET => [
        'บันทึกตรวจสอบความผิดและแจ้งหน่วยงานที่รับผิดชอบ',
        'กรอกการชำระเงินจากกรมขนส่ง',
        'กรอกการชำระเงินจากหน่วยงานที่รับผิดชอบ',
    ],
];
